# View Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalCommandData..::..View Property
ExternalCommandData Class See Also
---
Retrieves an object that represents the View external command work on.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public View View { get; set; }
```

Visual Basic
---
```text
Public Property View As View
	Get
	Set
```

Visual C++
---
```text
public:
property View^ View {
	View^ get ();
	void set (View^ value);
}
```

# See Also
ExternalCommandData Class
Autodesk.Revit.UI Namespace